







// // var lrc =

// // var kaishi=lrc.match("00:")

// // var lrcb="["+lrc.slice(kaishi.index)

// const lrcb=`
// [00:06.40]
// [00:14.26]试着留盏灯假装陪伴失眠的我
// [00:24.49]窗口就有等待的效果
// [00:31.88]已经习惯摆放好两人份的餐桌
// [00:40.93]这样看上去就不寂寞
// [00:46.91]那是你离开了北京的生活
// [00:54.30]街上的人偶尔会模仿你小动作
// [01:02.12]轻而易举就能将我击破
// [01:09.86]那些承诺提起人是你 还是我
// [01:24.41]那是你离开了北京的生活
// [01:31.57]我以为我爱了 就会留下些什么 纪念那些曲折
// [01:41.62]我们快乐的争吵的不舍的分分合合
// [01:50.06]我还是撑着 不说 我应该平静的
// [01:57.16]面对你离开了北京的生活
// [02:09.70]是否有人在对街窥探我的生活
// [02:16.56]督促我别过的不快乐
// [02:24.57]一晃而过看不清的是你 还是我
// [02:39.36]那是你离开了北京的生活
// [02:46.51]我以为我疯了 你在提醒我什么 别再故意招惹
// [02:56.43]那些爱过的 美好的 快乐的 不是施舍
// [03:04.86]我还是撑着 不说 我可以平静的
// [03:11.85]接受你离开了北京的生活
// [03:40.69]我以为是规则 失去最爱的一个 才能记忆深刻
// [03:50.73]那些 幼稚的 轻狂的 勇敢的 从此收着
// [03:59.42]我还在羡慕什么 街上哭的那个
// [04:06.42]你却无比希望他抱住另一个
// [04:14.78]那是你离开了北京的生活
// [04:14.873] 乐团 : 国际首席爱乐乐团
// [04:15.668] 木吉他 : 郭一凡
// [04:16.463] 电吉他 : 劳国贤
// [04:17.258] 贝斯 : 韩阳
// [04:18.053] 鼓 : 武勇恒
// [04:18.848] 和声 : 方毅
// [04:19.643] 和声编写 : 茶茶/方毅
// [04:20.438] 弦乐团 : 国际首席爱乐乐团
// [04:21.233] 弦乐监制 : 胡静成
// [04:22.028] 弦乐录音师 : 王小四
// [04:22.823] 弦乐录音室 : 金田录音棚
// [04:23.618] 乐器录音师 : 邢铜
// [04:24.413] 乐器录音室 : 55TEC Studio
// [04:25.208] 人声录音 : 汝文博
// [04:26.003] 人声录音室 : BIG.J Studio
// [04:26.798] 混音师 : 赵靖
// [04:27.593] 混音室 : BIG.J Studio
// [04:28.388] 母带 : 全相彦@OK Mastering Studio`;
// console.log(typeof(lrcb) )
// console.log(lrcb);



// /***** 用法 ******/
// const lrc = `
// [00:00.00]沙漠骆驼 - 展展与罗罗
// [00:03.00]作词：展展与罗罗
// [00:06.00]作曲：展展与罗罗
// [00:09.00]歌词编辑：果果
// [00:18.00]
// [00:26.21]我要穿越这片沙漠
// [00:28.24]找寻真的自我
// [00:30.39]身边只有一匹骆驼陪我
// [00:34.75]这片风儿吹过
// [00:36.92]那片云儿飘过
// [00:39.15]突然之间出现爱的小河
// [00:43.60]我跨上沙漠之舟
// [00:45.77]背上烟斗和沙漏
// [00:47.88]手里还握着一壶烈酒
// [05:24.97]END `;
// console.log(lrc);
// console.log(typeof(lrc) )

// const result = parseLyric(lrc)

// console.log(result);

// const  oLRC= parseLyric(lrcb)

// console.log(oLRC);




// function parseLyric(lyric) {
//     const lrcObj = {
//         // ti: '',
//         // ar: '',
//         // al: '',
//         // by: '',
//         ms: []
//     };

// /*
//     [ar:艺人名]
//     [ti:曲名]
//     [al:专辑名]
//     [by:编者（指编辑LRC歌词的人）]
//     [offset:时间补偿值] 其单位是毫秒，正值表示整体提前，负值相反。这是用于总体调整显示快慢的。
// */

//     const lrcArr = lyric.split("\n").filter(function (value) {
//         // 1.通过回车去分割歌词每一行,遍历数组，去除空行空格
//         return value.trim() !== ''
//     }).map(function (value) {
//         // 2.解析歌词
//         const line = parseLyricLine(value.trim())
//         // console.log(line);
//         if (line.type === 'lyric') {
//             lrcObj.ms.push(line.data)
//         } else {
//             lrcObj[line.type] = line.data
//         }
//         return value.trim();
//     })

//     function parseLyricLine(line) {
//         const tiArAlByExp = /^\[(ti|ar|al|by):(.*)\]$/
//         const lyricExp = /^\[(\d{2}):(\d{2}).(\d{2})\](.*)/
//         let result
//         if ((result = line.match(tiArAlByExp)) !== null) {
//             return {
//                 type: result[1],
//                 data: result[2]
//             }
//         } else if ((result = line.match(lyricExp)) !== null) {
//             return {
//                 type: 'lyric',
//                 data: {
//                     time: {
//                         m: result[1],
//                         s: result[2],
//                         ms: result[3]
//                     },
//                     lyric: result[4].trim()
//                 }
//             }
//         }
//     }

//     return lrcObj;
// }





const lrcb=`
[00:06.40]
[00:14.26]试着留盏灯假装陪伴失眠的我
[00:24.49]窗口就有等待的效果
[00:31.88]已经习惯摆放好两人份的餐桌
[00:40.93]这样看上去就不寂寞
[00:46.91]那是你离开了北京的生活
[00:54.30]街上的人偶尔会模仿你小动作
[01:02.12]轻而易举就能将我击破
[01:09.86]那些承诺提起人是你 还是我
[01:24.41]那是你离开了北京的生活
[01:31.57]我以为我爱了 就会留下些什么 纪念那些曲折
[01:41.62]我们快乐的争吵的不舍的分分合合
[01:50.06]我还是撑着 不说 我应该平静的
[01:57.16]面对你离开了北京的生活
[02:09.70]是否有人在对街窥探我的生活
[02:16.56]督促我别过的不快乐
[02:24.57]一晃而过看不清的是你 还是我
[02:39.36]那是你离开了北京的生活
[02:46.51]我以为我疯了 你在提醒我什么 别再故意招惹
[02:56.43]那些爱过的 美好的 快乐的 不是施舍
[03:04.86]我还是撑着 不说 我可以平静的
[03:11.85]接受你离开了北京的生活
[03:40.69]我以为是规则 失去最爱的一个 才能记忆深刻
[03:50.73]那些 幼稚的 轻狂的 勇敢的 从此收着
[03:59.42]我还在羡慕什么 街上哭的那个
[04:06.42]你却无比希望他抱住另一个
[04:14.78]那是你离开了北京的生活
[04:14.873] 乐团 : 国际首席爱乐乐团
[04:15.668] 木吉他 : 郭一凡
[04:16.463] 电吉他 : 劳国贤
[04:17.258] 贝斯 : 韩阳
[04:18.053] 鼓 : 武勇恒
[04:18.848] 和声 : 方毅
[04:19.643] 和声编写 : 茶茶/方毅
[04:20.438] 弦乐团 : 国际首席爱乐乐团
[04:21.233] 弦乐监制 : 胡静成
[04:22.028] 弦乐录音师 : 王小四
[04:22.823] 弦乐录音室 : 金田录音棚
[04:23.618] 乐器录音师 : 邢铜
[04:24.413] 乐器录音室 : 55TEC Studio
[04:25.208] 人声录音 : 汝文博
[04:26.003] 人声录音室 : BIG.J Studio
[04:26.798] 混音师 : 赵靖
[04:27.593] 混音室 : BIG.J Studio
[04:28.388] 母带 : 全相彦@OK Mastering Studio`;




var oLRC = {
    ti: "", //歌曲名
    ar: "", //演唱者
    al: "", //专辑名
    by: "", //歌词制作人
    offset: 0, //时间补偿值，单位毫秒，用于调整歌词整体位置
    ms: [] //歌词数组{t:时间,c:歌词}
};

function createLrcObj(lrc) {
	if(lrc.length==0) return;
    var lrcs = lrc.split('\n');//用回车拆分成数组
    for(var i in lrcs) {//遍历歌词数组
    	lrcs[i] = lrcs[i].replace(/(^\s*)|(\s*$)/g, ""); //去除前后空格
        var t = lrcs[i].substring(lrcs[i].indexOf("[") + 1, lrcs[i].indexOf("]"));//取[]间的内容
        var s = t.split(":");//分离:前后文字
        if(isNaN(parseInt(s[0]))) { //不是数值
            for (var i in oLRC) {
                if (i != "ms" && i == s[0].toLowerCase()) {
                    oLRC[i] = s[1];
                }
            }
        }else { //是数值
            var arr = lrcs[i].match(/\[(\d+:.+?)\]/g);//提取时间字段，可能有多个
            var start = 0;
            for(var k in arr){
                start += arr[k].length; //计算歌词位置
            }
            var content = lrcs[i].substring(start);//获取歌词内容
            for (var k in arr){
                var t = arr[k].substring(1, arr[k].length-1);//取[]间的内容
                var s = t.split(":");//分离:前后文字
                oLRC.ms.push({//对象{t:时间,c:歌词}加入ms数组
                    t: (parseFloat(s[0])*60+parseFloat(s[1])).toFixed(3),
                    c: content
                });
            }
        }
    }
    oLRC.ms.sort(function (a, b) {//按时间顺序排序
        return a.t-b.t;
    });
    
    for(var i in oLRC){ //查看解析结果
        console.log(i,":",oLRC[i]);
    }
    return oLRC
}

var m= createLrcObj(lrcb);
console.log(m)
// function showLRC() {
//     var s="";
//     for(var i in oLRC.ms){//遍历ms数组，把歌词加入列表
//         s+='<li>'+oLRC.ms[i].c+'</li>';
//     }
//     document.getElementById("lyric").innerHTML = s;
// }
// showLRC();
